nxp-mcuxpresso/mcux-sdk/devices/MCXN235/mcuxpresso/startup_mcxn235.c
WEAK void FLEXPWM1_SUBMODULE2_IRQHandler(void)
{   FLEXPWM1_SUBMODULE2_DriverIRQHandler();
}

WEAK void FLEXPWM1_SUBMODULE3_IRQHandler(void)
{   FLEXPWM1_SUBMODULE3_DriverIRQHandler();
}

WEAK void QDC0_COMPARE_IRQHandler(void)
{   QDC0_COMPARE_DriverIRQHandler();
}

WEAK void QDC0_HOME_IRQHandler(void)
{   QDC0_HOME_DriverIRQHandler();
}

WEAK void QDC0_WDG_SAB_IRQHandler(void)
{   QDC0_WDG_SAB_DriverIRQHandler();
}

WEAK void QDC0_IDX_IRQHandler(void)
{   QDC0_IDX_DriverIRQHandler();
}

WEAK void QDC1_COMPARE_IRQHandler(void)
{   QDC1_COMPARE_DriverIRQHandler();
}

WEAK void QDC1_HOME_IRQHandler(void)
{   QDC1_HOME_DriverIRQHandler();
}

WEAK void QDC1_WDG_SAB_IRQHandler(void)
{   QDC1_WDG_SAB_DriverIRQHandler();
}

WEAK void QDC1_IDX_IRQHandler(void)
{   QDC1_IDX_DriverIRQHandler();
}

WEAK void ITRC0_IRQHandler(void)
{   ITRC0_DriverIRQHandler();
}

WEAK void Reserved149_IRQHandler(void)
{   Reserved149_DriverIRQHandler();
}

WEAK void ELS_ERR_IRQHandler(void)
{   ELS_ERR_DriverIRQHandler();
}

WEAK void PKC_ERR_IRQHandler(void)
{   PKC_ERR_DriverIRQHandler();
}

WEAK void ERM_SINGLE_BIT_ERROR_IRQHandler(void)
{   ERM_SINGLE_BIT_ERROR_DriverIRQHandler();
}

WEAK void ERM_MULTI_BIT_ERROR_IRQHandler(void)
{   ERM_MULTI_BIT_ERROR_DriverIRQHandler();
}

WEAK void FMU0_IRQHandler(void)
{   FMU0_DriverIRQHandler();
}

WEAK void Reserved155_IRQHandler(void)
{   Reserved155_DriverIRQHandler();
}

WEAK void Reserved156_IRQHandler(void)
{   Reserved156_DriverIRQHandler();
}

WEAK void Reserved157_IRQHandler(void)
{   Reserved157_DriverIRQHandler();
}

WEAK void Reserved158_IRQHandler(void)
{   Reserved158_DriverIRQHandler();
}

WEAK void LPTMR0_IRQHandler(void)
{   LPTMR0_DriverIRQHandler();
}

WEAK void LPTMR1_IRQHandler(void)
{   LPTMR1_DriverIRQHandler();
}

WEAK void SCG_IRQHandler(void)
{   SCG_DriverIRQHandler();
}

WEAK void SPC_IRQHandler(void)
{   SPC_DriverIRQHandler();
}

WEAK void WUU_IRQHandler(void)
{   WUU_DriverIRQHandler();
}

WEAK void PORT_EFT_IRQHandler(void)
{   PORT_EFT_DriverIRQHandler();
}

WEAK void Reserved165_IRQHandler(void)
{   Reserved165_DriverIRQHandler();
}

WEAK void Reserved166_IRQHandler(void)
{   Reserved166_DriverIRQHandler();
}

WEAK void Reserved167_IRQHandler(void)
{   Reserved167_DriverIRQHandler();
}

WEAK void WWDT0_IRQHandler(void)
{   WWDT0_DriverIRQHandler();
}

WEAK void WWDT1_IRQHandler(void)
{   WWDT1_DriverIRQHandler();
}

WEAK void CMC0_IRQHandler(void)
{   CMC0_DriverIRQHandler();
}

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
